Ran Plan for project: `terraform-github` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.organization.github_team.techtales will be created
+ resource "github_team" "techtales" {
+       create_default_maintainer = false
+       description               = "needed for atlantis"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "techtales"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "secret"
+       slug                      = (known after apply)
    }

  # module.organization.github_team_membership.techtales_members["jazzlyn"] will be created
+ resource "github_team_membership" "techtales_members" {
+       etag     = (known after apply)
+       id       = (known after apply)
+       role     = "member"
+       team_id  = (known after apply)
+       username = "jazzlyn"
    }

  # module.organization.github_team_membership.techtales_members["techtales-automation"] will be created
+ resource "github_team_membership" "techtales_members" {
+       etag     = (known after apply)
+       id       = (known after apply)
+       role     = "member"
+       team_id  = (known after apply)
+       username = "techtales-automation"
    }

  # module.organization.github_team_membership.techtales_members["tyriis"] will be created
+ resource "github_team_membership" "techtales_members" {
+       etag     = (known after apply)
+       id       = (known after apply)
+       role     = "member"
+       team_id  = (known after apply)
+       username = "tyriis"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.techtales.io/lock?id=techtales-io%252Fterraform-github%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-github`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`